abdosalem490/stm32f407-drivers/drivers/HAL/DMA/DMA_reg.h
/******************************************************************************
 * Preprocessor Constants
 *******************************************************************************/

/**
 * @brief: this is the base address of DMA registers used to configure some of the DMA behaviors
 * @note: it will be referred to as @HAL_DMA_BASE_ADDR
 */
#define HAL_DMA1_OFFSET 0x00006000 /**< this is the offset of the DMA1 register from AHB1 bus base address*/
#define HAL_DMA2_OFFSET 0x00006400 /**< this is the offset of the DMA2 register from AHB1 bus base address*/

/**
 * @brief: bit definitions for DMA low interrupt status register (DMA_LISR)
 */
#define HAL_DMA_LISR_TCIF3 27 /**< Stream 3 transfer complete interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_LIFCR register.*/
#define HAL_DMA_LISR_TCIF2 21 /**< Stream 2 transfer complete interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_LIFCR register.*/
#define HAL_DMA_LISR_TCIF1 11 /**< Stream 1 transfer complete interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_LIFCR register.*/
#define HAL_DMA_LISR_TCIF0 5  /**< Stream 0 transfer complete interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_LIFCR register.*/

#define HAL_DMA_LISR_HTIF3 26 /**< Stream 3 half transfer interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_LIFCR register.*/
#define HAL_DMA_LISR_HTIF2 20 /**< Stream 2 half transfer interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_LIFCR register.*/
#define HAL_DMA_LISR_HTIF1 10 /**< Stream 1 half transfer interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_LIFCR register.*/
#define HAL_DMA_LISR_HTIF0 4  /**< Stream 0 half transfer interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_LIFCR register.*/

#define HAL_DMA_LISR_TEIF3 25 /**< Stream x transfer error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the  DMA_LIFCR register.*/
#define HAL_DMA_LISR_TEIF2 19 /**< Stream x transfer error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the  DMA_LIFCR register.*/
#define HAL_DMA_LISR_TEIF1 9  /**< Stream x transfer error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the  DMA_LIFCR register.*/
#define HAL_DMA_LISR_TEIF0 3  /**< Stream x transfer error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the  DMA_LIFCR register.*/

#define HAL_DMA_LISR_DMEIF3 24 /**< Stream 3 direct mode error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_LIFCR register.*/
#define HAL_DMA_LISR_DMEIF2 18 /**< Stream 2 direct mode error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_LIFCR register.*/
#define HAL_DMA_LISR_DMEIF1 8  /**< Stream 1 direct mode error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_LIFCR register.*/
#define HAL_DMA_LISR_DMEIF0 2  /**< Stream 0 direct mode error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_LIFCR register.*/

#define HAL_DMA_LISR_FEIF3 22 /**< Stream 3 FIFO error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_LIFCR register.*/
#define HAL_DMA_LISR_FEIF2 16 /**< Stream 2 FIFO error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_LIFCR register.*/
#define HAL_DMA_LISR_FEIF1 6  /**< Stream 1 FIFO error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_LIFCR register.*/
#define HAL_DMA_LISR_FEIF0 0  /**< Stream 0 FIFO error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_LIFCR register.*/

/**
 * @brief: bit definitions for DMA high interrupt status register (DMA_HISR)
 */
#define HAL_DMA_HISR_TCIF7 27 /**< Stream 7 transfer complete interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_HIFCR register.*/
#define HAL_DMA_HISR_TCIF6 21 /**< Stream 6 transfer complete interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_HIFCR register.*/
#define HAL_DMA_HISR_TCIF5 11 /**< Stream 5 transfer complete interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_HIFCR register.*/
#define HAL_DMA_HISR_TCIF4 5  /**< Stream 4 transfer complete interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_HIFCR register.*/

#define HAL_DMA_HISR_HTIF7 26 /**< Stream 7 half transfer interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_HIFCR register.*/
#define HAL_DMA_HISR_HTIF6 20 /**< Stream 6 half transfer interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_HIFCR register.*/
#define HAL_DMA_HISR_HTIF5 10 /**< Stream 4 half transfer interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_HIFCR register.*/
#define HAL_DMA_HISR_HTIF4 4  /**< Stream 3 half transfer interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_HIFCR register.*/

#define HAL_DMA_HISR_TEIF7 25 /**< Stream x transfer error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_HIFCR register.*/
#define HAL_DMA_HISR_TEIF6 19 /**< Stream x transfer error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_HIFCR register.*/
#define HAL_DMA_HISR_TEIF5 9  /**< Stream x transfer error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_HIFCR register.*/
#define HAL_DMA_HISR_TEIF4 3  /**< Stream x transfer error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_HIFCR register.*/

#define HAL_DMA_HISR_DMEIF7 24 /**< Stream 7 direct mode error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_HIFCR register.*/
#define HAL_DMA_HISR_DMEIF6 18 /**< Stream 6 direct mode error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_HIFCR register.*/
#define HAL_DMA_HISR_DMEIF5 8  /**< Stream 5 direct mode error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_HIFCR register.*/
#define HAL_DMA_HISR_DMEIF4 2  /**< Stream 4 direct mode error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_HIFCR register.*/

#define HAL_DMA_HISR_FEIF7 22 /**< Stream 7 FIFO error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_HIFCR register.*/
#define HAL_DMA_HISR_FEIF6 16 /**< Stream 6 FIFO error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_HIFCR register.*/
#define HAL_DMA_HISR_FEIF5 6  /**< Stream 5 FIFO error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_HIFCR register.*/
#define HAL_DMA_HISR_FEIF4 0  /**< Stream 4 FIFO error interrupt flag. This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_HIFCR register.*/

/**
 * @brief: bit definitions for DMA low interrupt flag clear register (DMA_LIFCR)
 */
#define HAL_DMA_LIFCR_CTCIF3 27 /**< Stream 3 clear transfer complete interrupt flag. Writing 1 to this bit clears the corresponding TCIFx flag in the DMA_LISR register.*/
#define HAL_DMA_LIFCR_CTCIF2 21 /**< Stream 2 clear transfer complete interrupt flag. Writing 1 to this bit clears the corresponding TCIFx flag in the DMA_LISR register.*/
#define HAL_DMA_LIFCR_CTCIF1 11 /**< Stream 1 clear transfer complete interrupt flag. Writing 1 to this bit clears the corresponding TCIFx flag in the DMA_LISR register.*/
#define HAL_DMA_LIFCR_CTCIF0 5  /**< Stream 0 clear transfer complete interrupt flag. Writing 1 to this bit clears the corresponding TCIFx flag in the DMA_LISR register.*/

#define HAL_DMA_LIFCR_CHTIF3 26 /**< Stream 3 clear half transfer interrupt flag. Writing 1 to this bit clears the corresponding HTIFx flag in the DMA_LISR register.*/
#define HAL_DMA_LIFCR_CHTIF2 20 /**< Stream 2 clear half transfer interrupt flag. Writing 1 to this bit clears the corresponding HTIFx flag in the DMA_LISR register.*/
#define HAL_DMA_LIFCR_CHTIF1 10 /**< Stream 1 clear half transfer interrupt flag. Writing 1 to this bit clears the corresponding HTIFx flag in the DMA_LISR register.*/
#define HAL_DMA_LIFCR_CHTIF0 4  /**< Stream 0 clear half transfer interrupt flag. Writing 1 to this bit clears the corresponding HTIFx flag in the DMA_LISR register.*/

