abdosalem490/stm32f407-drivers/drivers/HAL/DMA/DMA_reg.h
#define HAL_DMA_LIFCR_CTEIF3 25 /**< Stream 3 clear transfer error interrupt flag. Writing 1 to this bit clears the corresponding TEIFx flag in the DMA_LISR register.*/
#define HAL_DMA_LIFCR_CTEIF2 19 /**< Stream 2 clear transfer error interrupt flag. Writing 1 to this bit clears the corresponding TEIFx flag in the DMA_LISR register.*/
#define HAL_DMA_LIFCR_CTEIF1 9  /**< Stream 1 clear transfer error interrupt flag. Writing 1 to this bit clears the corresponding TEIFx flag in the DMA_LISR register.*/
#define HAL_DMA_LIFCR_CTEIF0 3  /**< Stream 0 clear transfer error interrupt flag. Writing 1 to this bit clears the corresponding TEIFx flag in the DMA_LISR register.*/

#define HAL_DMA_LIFCR_CDMEIF3 24 /**< Stream 3 clear direct mode error interrupt flag. Writing 1 to this bit clears the corresponding DMEIFx flag in the DMA_LISR register.*/
#define HAL_DMA_LIFCR_CDMEIF2 18 /**< Stream 2 clear direct mode error interrupt flag. Writing 1 to this bit clears the corresponding DMEIFx flag in the DMA_LISR register.*/
#define HAL_DMA_LIFCR_CDMEIF1 8  /**< Stream 1 clear direct mode error interrupt flag. Writing 1 to this bit clears the corresponding DMEIFx flag in the DMA_LISR register.*/
#define HAL_DMA_LIFCR_CDMEIF0 2  /**< Stream 0 clear direct mode error interrupt flag. Writing 1 to this bit clears the corresponding DMEIFx flag in the DMA_LISR register.*/

#define HAL_DMA_LIFCR_CFEIF3 22 /**< Stream 3 clear FIFO error interrupt flag. Writing 1 to this bit clears the corresponding CFEIFx flag in the DMA_LISR register.*/
#define HAL_DMA_LIFCR_CFEIF2 16 /**< Stream 2 clear FIFO error interrupt flag. Writing 1 to this bit clears the corresponding CFEIFx flag in the DMA_LISR register.*/
#define HAL_DMA_LIFCR_CFEIF1 6  /**< Stream 1 clear FIFO error interrupt flag. Writing 1 to this bit clears the corresponding CFEIFx flag in the DMA_LISR register.*/
#define HAL_DMA_LIFCR_CFEIF0 0  /**< Stream 0 clear FIFO error interrupt flag. Writing 1 to this bit clears the corresponding CFEIFx flag in the DMA_LISR register.*/

/**
 * @brief: bit definitions for DMA high interrupt flag clear register (DMA_HIFCR)
 */
#define HAL_DMA_HIFCR_CTCIF7 27 /**< Stream 7 clear transfer complete interrupt flag. Writing 1 to this bit clears the corresponding TCIFx flag in the DMA_HISR register */
#define HAL_DMA_HIFCR_CTCIF6 21 /**< Stream 6 clear transfer complete interrupt flag. Writing 1 to this bit clears the corresponding TCIFx flag in the DMA_HISR register */
#define HAL_DMA_HIFCR_CTCIF5 11 /**< Stream 5 clear transfer complete interrupt flag. Writing 1 to this bit clears the corresponding TCIFx flag in the DMA_HISR register */
#define HAL_DMA_HIFCR_CTCIF4 5  /**< Stream 4 clear transfer complete interrupt flag. Writing 1 to this bit clears the corresponding TCIFx flag in the DMA_HISR register */

#define HAL_DMA_HIFCR_CHTIF7 26 /**< Stream 7 clear half transfer interrupt flag. Writing 1 to this bit clears the corresponding HTIFx flag in the DMA_HISR register.*/
#define HAL_DMA_HIFCR_CHTIF6 20 /**< Stream 6 clear half transfer interrupt flag. Writing 1 to this bit clears the corresponding HTIFx flag in the DMA_HISR register.*/
#define HAL_DMA_HIFCR_CHTIF5 10 /**< Stream 5 clear half transfer interrupt flag. Writing 1 to this bit clears the corresponding HTIFx flag in the DMA_HISR register.*/
#define HAL_DMA_HIFCR_CHTIF4 4  /**< Stream 4 clear half transfer interrupt flag. Writing 1 to this bit clears the corresponding HTIFx flag in the DMA_HISR register.*/

#define HAL_DMA_HIFCR_CTEIF7 25 /**< Stream 7 clear transfer error interrupt flag. Writing 1 to this bit clears the corresponding TEIFx flag in the DMA_HISR register.*/
#define HAL_DMA_HIFCR_CTEIF6 19 /**< Stream 6 clear transfer error interrupt flag. Writing 1 to this bit clears the corresponding TEIFx flag in the DMA_HISR register.*/
#define HAL_DMA_HIFCR_CTEIF5 9  /**< Stream 5 clear transfer error interrupt flag. Writing 1 to this bit clears the corresponding TEIFx flag in the DMA_HISR register.*/
#define HAL_DMA_HIFCR_CTEIF4 3  /**< Stream 4 clear transfer error interrupt flag. Writing 1 to this bit clears the corresponding TEIFx flag in the DMA_HISR register.*/

#define HAL_DMA_HIFCR_CDMEIF7 24 /**< Stream 7 clear direct mode error interrupt flag. Writing 1 to this bit clears the corresponding DMEIFx flag in the DMA_HISR register.*/
#define HAL_DMA_HIFCR_CDMEIF6 18 /**< Stream 6 clear direct mode error interrupt flag. Writing 1 to this bit clears the corresponding DMEIFx flag in the DMA_HISR register.*/
#define HAL_DMA_HIFCR_CDMEIF5 8  /**< Stream 5 clear direct mode error interrupt flag. Writing 1 to this bit clears the corresponding DMEIFx flag in the DMA_HISR register.*/
#define HAL_DMA_HIFCR_CDMEIF4 2  /**< Stream 4 clear direct mode error interrupt flag. Writing 1 to this bit clears the corresponding DMEIFx flag in the DMA_HISR register.*/

#define HAL_DMA_HIFCR_CFEIF7 22 /**< Stream 7 clear FIFO error interrupt flag. Writing 1 to this bit clears the corresponding CFEIFx flag in the DMA_HISR register.*/
#define HAL_DMA_HIFCR_CFEIF6 16 /**< Stream 6 clear FIFO error interrupt flag. Writing 1 to this bit clears the corresponding CFEIFx flag in the DMA_HISR register.*/
#define HAL_DMA_HIFCR_CFEIF5 6  /**< Stream 5 clear FIFO error interrupt flag. Writing 1 to this bit clears the corresponding CFEIFx flag in the DMA_HISR register.*/
#define HAL_DMA_HIFCR_CFEIF4 0  /**< Stream 4 clear FIFO error interrupt flag. Writing 1 to this bit clears the corresponding CFEIFx flag in the DMA_HISR register.*/

/**
 * @brief: bit definitions for DMA stream x configuration register (DMA_SxCR) (x = 0..7)
 */
#define HAL_DMA_SxCR_CHSEL 25  /**< Channel selection. These bits are set and cleared by software. These bits are protected and can be written only if EN is ‘0’.*/
#define HAL_DMA_SxCR_MBURST 23 /**< Memory burst transfer configuration. These bits are set and cleared by software. These bits are protected and can be written only if EN is ‘0’ In direct mode, these bits are forced to 0x0 by hardware as soon as bit EN= '1'.*/
#define HAL_DMA_SxCR_PBURST 21 /**< Peripheral burst transfer configuration. These bits are set and cleared by software. These bits are protected and can be written only if EN is ‘0’. In direct mode, these bits are forced to 0x0 by hardware.*/
#define HAL_DMA_SxCR_CT 19     /**< Current target (only in double buffer mode). This bits is set and cleared by hardware. It can also be written by software. This bit can be written only if EN is ‘0’ to indicate the target memory area of the first transfer. Once the stream is enabled, this bit operates as a status flag indicating which memory area is the current target.*/
#define HAL_DMA_SxCR_DBM 18    /**< Double buffer mode. This bits is set and cleared by software. This bit is protected and can be written only if EN is ‘0’.*/
#define HAL_DMA_SxCR_PL 16     /**< Priority level. These bits are set and cleared by software. These bits are protected and can be written only if EN is ‘0’.*/
#define HAL_DMA_SxCR_PINCOS 15 /**< Peripheral increment offset size. This bit is set and cleared by software. This bit has no meaning if bit PINC = '0'. This bit is protected and can be written only if EN = '0'. This bit is forced low by hardware when the stream is enabled (bit EN = '1') if the direct  mode is selected or if PBURST are different from “00”.*/
#define HAL_DMA_SxCR_MSIZE 13  /**< Memory data size. These bits are set and cleared by software. These bits are protected and can be written only if EN is ‘0’. In direct mode, MSIZE is forced by hardware to the same value as PSIZE as soon as bit EN  = '1'.*/
#define HAL_DMA_SxCR_PSIZE 11  /**< Peripheral data size. These bits are set and cleared by software. These bits are protected and can be written only if EN is ‘0’.*/
#define HAL_DMA_SxCR_MINC 10   /**< Memory increment mode. This bit is set and cleared by software. This bit is protected and can be written only if EN is ‘0’.*/
#define HAL_DMA_SxCR_PINC 9    /**< Peripheral increment mode. This bit is set and cleared by software. This bit is protected and can be written only if EN is ‘0’.*/
#define HAL_DMA_SxCR_CIRC 8    /**< Circular mode. This bit is set and cleared by software and can be cleared by hardware. When the peripheral is the flow controller (bit PFCTRL=1) and the stream is enabled (bit EN=1), then this bit is automatically forced by hardware to 0.  It is automatically forced by hardware to 1 if the DBM bit is set, as soon as the stream is enabled (bit EN ='1').*/
#define HAL_DMA_SxCR_DIR 6     /**< Data transfer direction. These bits are set and cleared by software. These bits are protected and can be written only if EN is ‘0’. */
#define HAL_DMA_SxCR_PFCTRL 5  /**< Peripheral flow controller. This bit is set and cleared by software. This bit is protected and can be written only if EN is ‘0’. When the memory-to-memory mode is selected (bits DIR[1:0]=10), then this bit is automatically forced to 0 by hardware.*/
#define HAL_DMA_SxCR_TCIE 4    /**< Transfer complete interrupt enable. This bit is set and cleared by software.*/
#define HAL_DMA_SxCR_HTIE 3    /**< Half transfer interrupt enable. This bit is set and cleared by software. */
#define HAL_DMA_SxCR_TEIE 2    /**< Transfer error interrupt enable. This bit is set and cleared by software.*/
#define HAL_DMA_SxCR_DMEIE 1   /**< Direct mode error interrupt enable. This bit is set and cleared by software.*/
#define HAL_DMA_SxCR_EN 0      /**< Stream enable / flag stream ready when read low. This bit is set and cleared by software. */

/**
 * @brief: bit definitions for DMA stream x number of data register (DMA_SxNDTR) (x = 0..7)
 */
#define HAL_DMA_SxNDTR_NDT 0 /**< Number of data items to transfer. Number of data items to be transferred (0 up to 65535)*/

/**
 * @brief: bit definitions for DMA stream x FIFO control register (DMA_SxFCR) (x = 0..7)
 */
#define HAL_DMA_SxFCR_FEIE 7  /**< FIFO error interrupt enable. This bit is set and cleared by software.*/
#define HAL_DMA_SxFCR_FS 3    /**< FIFO status. These bits are read-only. others: no meaning. These bits are not relevant in the direct mode (DMDIS bit is zero).*/
#define HAL_DMA_SxFCR_DMDIS 2 /**<  Direct mode disable. This bit is set and cleared by software. It can be set by hardware. This bit is protected and can be written only if EN is ‘0’. This bit is set by hardware if the memory-to-memory mode is selected (DIR bit in  DMA_SxCR are “10”) and the EN bit in the DMA_SxCR register is ‘1’ because the direct  mode is not allowed in the memory-to-memory configuration.*/
#define HAL_DMA_SxFCR_FTH 0   /**< FIFO threshold selection. These bits are set and cleared by software. These bits are not used in the direct mode when the DMIS value is zero. These bits are protected and can be written only if EN is ‘0’.*/
#define HAL_DMA_SxFCR_FTH 0   /**< FIFO threshold selection. These bits are set and cleared by software. These bits are not used in the direct mode when the DMIS value is zero. These bits are protected and can be written only if EN is ‘0’.*/

