abdosalem490/stm32f407-drivers/drivers/HAL/DMA/DMA_reg.h
/******************************************************************************
 * Configuration Constants
 *******************************************************************************/

/******************************************************************************
 * Macros
 *******************************************************************************/

/******************************************************************************
 * Typedefs
 *******************************************************************************/

/**
 * @brief: holds configurations for each stream
 */
typedef struct
{
    __io uint32_t DMA_SxCR;   /**< DMA stream x configuration register. This register is used to configure the concerned stream. Address offset: 0x10 + 0x18 × stream number. */
    __io uint32_t DMA_SxNDTR; /**< DMA stream x number of data register. Address offset: 0x14 + 0x18 × stream number. */
    __io uint32_t DMA_SxPAR;  /**< DMA stream x peripheral address register. Address offset: 0x18 + 0x18 × stream number. */
    __io uint32_t DMA_SxM0AR; /**< DMA stream x memory 0 address register. Address offset: 0x1C + 0x18 × stream number. */
    __io uint32_t DMA_SxM1AR; /**< DMA stream x memory 1 address register. Address offset: 0x20 + 0x18 × stream number. */
    __io uint32_t DMA_SxFCR;  /**< DMA stream x FIFO control register. Address offset: 0x24 + 0x24 × stream number. */
} HAL_DMA_StreamRegDef_t;

/**
 * @brief: this holds all registers used to configure DMA
 */
typedef struct
{
    __io uint32_t DMA_LISR;                 /**< DMA low interrupt status register.*/
    __io uint32_t DMA_HISR;                 /**< DMA high interrupt status register.*/
    __io uint32_t DMA_LIFCR;                /**< DMA low interrupt flag clear register. */
    __io uint32_t DMA_HIFCR;                /**< DMA high interrupt flag clear register. */
    __io HAL_DMA_StreamRegDef_t Streams[8]; /**< contains registers regarding each stream*/
} HAL_DMA_RegDef_t;

static __io HAL_DMA_RegDef_t *const global_pDMA1Reg_t = ((HAL_DMA_RegDef_t *)(HAL_CM4F_AHB1_BASEADDR + HAL_DMA1_OFFSET)); /**< this is a pointer variable through which we will access our DMA1 registers to configure them*/
static __io HAL_DMA_RegDef_t *const global_pDMA2Reg_t = ((HAL_DMA_RegDef_t *)(HAL_CM4F_AHB1_BASEADDR + HAL_DMA2_OFFSET)); /**< this is a pointer variable through which we will access our DMA2 registers to configure them*/

/******************************************************************************
 * Variables
 *******************************************************************************/

/******************************************************************************
 * Function Prototypes
 *******************************************************************************/

/******************************************************************************
 * Interface for peripherals in same level
 *******************************************************************************/

/*** End of File **************************************************************/
#endif /*HAL_DMA_REG_H_*/
